import DetailCatBreed from "./DetailCatBreed";
import { useEffect, useState } from "react";
import CatModel from "./Model";
import SlideCat from "./CatSlide";
import { styled } from "@mui/material";

function CatBreedDetail() {
  const dataCat = [
    {
      nameTh: "อเมริกันช็อตแฮร์",
      nameEn: "American Short hair",
      detail:
        "ในความเป็นจริงประวัติของน้องแมวอเมริกัน ช็อตแฮร์ นั้นยังคงคลุมเครือไม่ชัดเจนแต่ที่ไม่ต้องสงสัย คือ น้องแมวเหล่านี้ลงเรือโดยสาร “Mayflower” จากประเทศอังกฤษ มาขึ้นฝั่งยังเมือง Plymouth รัฐ Massachusetts พร้อมกับชาวอังกฤษ (หรือชาวอเมริกัน) กลุ่มแรกในปี ค.ศ. 1620 ด้วยความสามารถในการจับหนูทำให้น้องแมวมีประโยชน์อย่างมากสำหรับเรือโดยสาร บางหลักฐานกล่าวว่าน้องแมวอเมริกัน ช็อตแฮร์ อาจมาถึงทวีปอเมริกาเหนือก่อนหน้านั้น ไม่ว่าจะเป็นการมากับเรือของเหล่าผู้เริ่มก่อตั้ง Jamestown Colony ในรัฐ Virginia หรือ การสำรวจของเสปนที่ไปยังรัฐ Florida แม้กระทั่งมาพร้อมกับเรือของเหล่าไวกิ้งไปยังเมือง Newfoundland ประเทศแคนาดา ลูกหลานของเหล่าน้องแมวโพ้นทะเลเหล่านี้เป็นที่รู้จักกันในนาม domestic shorthair จนกลายมาเป็นสายพันธุ์ American shorthair ที่เรารู้จักกันในปัจจุบัน <br/><br/>- ในปี ค.ศ. 1634 เริ่มมีผู้คนนำแมวพันธุ์อเมริกัน ช็อตแฮร์ มาใช้งาน เช่น ชาวนา เจ้าของร้านหรือนำมาเลี้ยงไว้ในบ้าน เพื่อใช้ป้องกันหนูหรือศัตรูพืชที่กินมากินอาหารเพราะเป็นแมวที่ แข็งแรง และเข้มแข็ง<br/><br/>- ในปี ค.ศ. 1896 แมวพันธุ์อเมริกัน ช็อตแฮร์ เริ่มเป็นที่นิยมเลี้ยงและมีจำนวนมากขึ้นป็นอย่างมาก                                                                                         รวมถึงได้ถูกนำมาประกวดแมวที่ Madison Square Garden เเละ มีราคาซื้อขายกันอยู่ที 2,500 เหรียญสหรัฐฯ<br/><br/>- ในปี ค.ศ. 1906 สมาคม The Cat Fanciers Association ได้มีการขึ้นทะเบียนให้ถูกจัดอยู่ใน                                                                      ไนกลุ่มแมวไม่ทราบสายพันธุ์ (Random-bred cats) หรือเป็นที่รู้จักกันด้วยทั่วไปคือเป็นแมวพันธุ์                                                                           พื้นเมือง (Domestic Shorthairs)",
      pic: "/AmericanStand.png",
      pic1: "/AmeriBox1.png",
      pic2: "/AmeriBox2.png",
      pic3: "/AmeriBox3.png",
      dcs1: '<div style="display: block">APPERANCE<br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Size :</p>  ปานกลาง</div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Hair :</p>  ขนสั้น</div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Colors :</p>  ดำ, เทา, ขาว, ครีม, Chinchilla, Lilac, Chocolate</div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Pattern :</p>  Tabby, Tottoiseshell, Tricolor, Bicolor, Colorpoint</div><br/><br/> แมวพันธุ์ อเมริกัน ช็อตแฮร์ เป็นแมวขนาดกลาง ลำตัวเป็นกล้ามเนื้อแน่น โดยหัวมีลักษณะใหญ่ หน้าผากเรียบ โค้งนูนปานกลาง, โหนกแก้มมีความยาวมากกว่ากว้าง เห็นชัดเจนจมูกมีขนาดปานกลาง มีความยาวเท่ากับความกว้าง, หูมีขนาดปานกลางส่วนปลายกว้างออก ความกว้างระหว่างหูมากกว่าความกว้างระหว่างตาสองเท่า, หางยาวปานกลางส่วนฐานใหญ่ แต่ส่วนปลายทู่ ลักษณะเส้นขนสั้น หนา แข็ง เพื่อให้สามารถทนต่อสภาพอากาศหนาว ป้องกันการบาดเจ็บที่ผิวหนัง และป้องกันความชื้นโดยสีขนสามารถพบได้ หลากหลายสี หลากหลายรูปแบบมากถึง 80 แบบ ซึ่งทุกแบบจะต้องมีสีพื้นฐานเป็นส่วนประกอบอย่างน้อยหนึ่งสีเช่น สีขาว (White), สีดำ (Black), สีครีม (Cream), สีน้ำตาล (Brown), สีชินชิล่า (Chinchilla)เป็นต้น แมวพันธุ์ อเมริกัน ช็อตแฮร์ เพศผู้มีความสูงมาตรฐานอยู่ที่ 12-14 นิ้ว หรือ 30.5-35.6 เซนติเมตร และมีน้ำหนักมาตรฐานอยู่ที่ 14-16 ปอนด์ หรือ 6.4-7.3 กิโลกรัม และเพศเมียมีความสูงมาตรฐานอยู่ที่ 10-12 นิ้ว หรือ 25.4-30.5 เซนติเมตรและมีน้ำหนักมาตรฐานอยู่ที่ 10-15 ปอนด์ หรือ 4.5-6.8 กิโลกรัม โดย อเมริกัน ช็อตแฮร์จะมีอายุขัยโดยทั่วไปเฉลี่ยอยู่ที่ 15-20 ปี</div>',
      dcs2: "แมวพันธุ์อเมริกัน ช็อตแฮร์ เป็นแมวขี้เล่น ร่าเริง เป็นมิตร รักความสนุกสนาน สามารถปรับตัวเข้ากับครอบครัวได้ เป็นแมวที่ต้องการความรักความสนใจ มักจะเรียกร้องให้เจ้าของเล่นด้วยโดยเฉพาะชอบเล่นของเล่นประเภทที่ใช้เหยื่อปลอมล่อให้แมววิ่งเล่น เพราะมีความเป็นนักล่าสูง ทำให้ชอบวิ่งเล่นไล่จับสัตว์ แมวพันธุ์อเมริกัน ช็อตแฮร์ มีความอดทนต่อการถูกทิ้งไว้ตัวเดียวสามารถใช้เวลานั้นนอนตอนกลางวันได้นอกจากนี้ยังสามารถผูกมิตรกับสัตว์ตัวอื่นในบ้านได้ง่ายเหมาะสำหรับเลี้ยงในครอบครัว หรือเลี้ยงในบ้านที่มีเด็กเล็กเป็นอย่างดีสามารถเลี้ยงรวมกับแมวตัวอื่นในบ้านได้ไม่มีปัญหาเรื่องทะเลาะกัน<br/><br/>ด้านการเข้าสังคมแมวอเมริกัน ช็อตแฮร์ มักทำได้ดี น้องแมวมีความกล้าหาญและมักเข้ากันได้ดีกับคนแปลกหน้า ไม่ได้ขี้กลัวจนต้องวิ่งไปหลบอยู่ใต้ตู้ใต้เตียงเมื่อมีแขกมาเยี่ยมถึงบ้าน แต่ก็ไม่ได้หมายความว่าคุณคนแปลกหน้าใครจะอุ้มน้องไปไหนก็ได้<br/><br/>เมื่อพูดถึงการอุ้ม อเมริกัน ช็อตแฮร์ ไม่ใช่แมวที่จะชอบให้คุณอุ้มเดินไปไหนต่อไหนอยู่ตลอดเวลา จงปล่อยให้เขาเดินด้วยขา ทั้งสี่ของตัวเอง อาจจะไม่ได้เป็นแมวที่เข้ามาอ้อนของนั่งบนตักของคุณ แต่ก็ยังชื่นชนชอบที่จะมีมุมเล็กๆ นั่งข้างๆ คุณบนโซฟาหรือบนเตียงนอน",
      dcs3: "โรคกล้ามเนื้อหัวใจเสื่อม (Dilated cardiomyopathy : DCM)<br/><br/>โรคระบบทางเดินปัสสาวะและไตกลุ่มโรคไตรั่ว (Hereditary nephritis) <br/><br/>โรคทางเดินปัสสาวะส่วนล่างของแมว (Feline Lower Urinary Tract Disease : FLUTD) <br/><br/>ไตวายแบบเรื้อรัง (Chronic renal failure) <br/><br/>ภาวะเกิดถุงน้ำภายในไต (Polycystic kidney disease : PKD) <br/><br/>ไทรอยด์เป็นพิษ (Hyperthyroidism) <br/><br/>โรคเบาหวาน (Diabetes Mellitus : DM) <br/><br/>โรคหูหนวกตั้งแต่กำเนิด (Congenital deafness) <br/><br/>",
      id: 1,
      bgColor: "#B6C4A0",
    },
    {
      nameTh: "บริทิชช็อตแฮร์",
      nameEn: "British Short hair",
      detail:
        "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque dapibus nunc in ipsum condimentum vehicula. Aliquam quis dui ullamcorper leo dignissim auctor. Nulla volutpat congue tortor a tristique. Proin quis commodo neque. Aliquam erat volutpat. Curabitur rutrum consequat mollis. Suspendisse ultricies non ante vitae consectetur. Morbi arcu elit, consectetur in venenatis vel, gravida placerat nisl. Nam lobortis ante sit amet gravida egestas.",
      pic: "/BritishStand.png",
      pic1: "/BrittishBox1.png",
      pic2: "/BrittishBox2.png",
      pic3: "/BrittishBox3.png",
      dcs1: '<div style="display: block">APPERANCE<br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Size :</p>  ปานกลาง/ใหญ่ </div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Hair :</p>  ขนสั้น/ยาว </div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Colors :</p>ดำ, แดง, ขาว, ครีม, น้ำตาล, เงิน, Camero, Blue, BlueCream, Smoke, Shade </div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Pattern :</p>  สีล้วน, Tabby, Smoke, Tricolor, Bicolor, Colorpoint, Calico, Shade</div> <br/><br/> แมวพันธุ์ บริติช ช็อตแฮร์ เป็นเเมวขนาดกลางถึงใหญ่ รูปร่างกะทัดรัด สมส่วน ลำตัวเป็นกล้ามเนื้อแน่นแข็งเเรง โดยส่วนมากพบว่าตัวเมียจะมีขนาดเล็กกว่าตัวผู้เพียงเล็กน้อยเท่านั้น โดยหัวมีลักษณะใหญ่กลม แก้มกลม คางกระชับเข้ารูปกับใบหน้า ใบหูมีขนาดกลางเเละตั้งตรง ลักษณะของเส้นขนเป็นขนเเบบชั้นเดียว ไม่มีขนชั้นใน ถึงเเม้ว่า สายพันธ์นี้จะปรากฏสี Blue เป็นส่วนใหญ่ (ด้วยความต้องการทางการตลาดทำให้พบเห็นสีนี้มากกว่าสีอื่นๆ) เเต่ก็ยังสามารถพบเห็นบริทิช ช็อตเเฮร์สีอื่นๆได้เช่นกัน</div>',
      dcs2: "แมวบริติช ช็อตแฮร์ นั้นน่ารัก เรียบร้อย และเข้ากับคนอื่นง่าย ทำให้กลายเป็นแมวเลี้ยงที่ลงตัวมากสำหรับครอบครัว แมวบริติช ช็อตแฮร์ ชอบที่จะเป็นรักและสนใจจากคนรอบข้าง แต่ก็ไม่ได้เรียกร้องความสนใจจนมากเกินไป มักชอบเดินตามเจ้าของไปรอบๆ บ้านแล้วนั่งลงข้างๆ ไม่ว่าคุณจะทำอะไร บริติช ช็อตแฮร์ เป็นน้องแมวที่ค่อนข้างสงบเสงี่ยม ไม่ค่อยส่งเสียงดังหรือร้องเรียกในสิ่งใดใดที่ต้องการ น้องจะไม่ปีนขึ้นมานั่งบนตักขอให้คุณเกาคางให้แต่จะนั่งข้างๆ อีกอย่างคือเพียงแค่ลูบกันก็พอไม่ต้องอุ้มไปไหนมาไหนมากก็ได้แมวบริติช ช็อตแฮร์ เป็นแมวที่ต้องการกิจกรรมและออกกำลังกายในระดับปานกลาง แน่นอนว่าตอนยังเป็นเด็ก จะมีพลังงานสูงมาก แต่ก็จะสงบลงเมื่อเริ่มโตเป็นผู้ใหญ่ แมวบริติช ช็อตแฮร์ ที่โตแล้วส่วนใหญ่เลือกที่จะนอนกลิ้งบนโซฟามากกว่าออกไปเล่นข้างนอก แต่ก็มีน้องแมวบางตัว (ส่วนใหญ่จะเป็นตัวผู้) ที่ยังชอบทำตัวเหมือนเด็กน้อยอยู่ แมวบริติช ช็อตแฮร์ ไม่ค่อยมีชื่อเสียงในเรื่องของการทำลายข้างของและเฟอร์นิเจอร์ มักทำตัวเหมือนเป็นผู้ที่ได้รับการอบรมมารยาทมาอย่างดีแล้ว และพร้อมที่จะต้อนรับแขกที่มาบ้านด้วยความสุภาพอ่อนโยนแต่มั่นใจสมกับเป็นผู้ดีอังกฤษ",
      dcs3: "โรคที่พบบ่อยในเเมวบริทิช ช็อตแฮร์- โรคเหงือกอักเสบ - โรคหัวใจ ชนิด Hypertrophic cardiomyopathy ซึ่งเป็นโรคหัวใจประเภทหนึ่ง",
      id: 2,
      bgColor: "#D7878A",
    },
    {
      nameTh: "สก๊อตติซโฟล์ด",
      nameEn: "ScottishFold",
      detail:
        "Lorem ipsum dolor sit amet, consectetur adipiscing elit. Pellentesque dapibus nunc in ipsum condimentum vehicula. Aliquam quis dui ullamcorper leo dignissim auctor. Nulla volutpat congue tortor a tristique. Proin quis commodo neque. Aliquam erat volutpat. Curabitur rutrum consequat mollis. Suspendisse ultricies non ante vitae consectetur. Morbi arcu elit, consectetur in venenatis vel, gravida placerat nisl. Nam lobortis ante sit amet gravida egestas.",
      pic: "/ScottishStand.png",
      pic1: "/ScottishBox1.png",
      pic2: "/ScottishBox2.png",
      pic3: "/ScottishBox3.png",
      dcs1: '<div style="display: block">APPERANCE<br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Size :</p>  ปานกลาง/ใหญ่ </div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Hair :</p>  ขนสั้น/ยาว </div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Colors :</p>ดำ, แดง, ขาว, ครีม, น้ำตาล, เงิน, Camero, Blue, BlueCream, Smoke, Shade </div><br/><div style="display: ruby"><p style="margin: 0; font-weight: bold">Pattern :</p>  สีล้วน, Tabby, Smoke, Bicolor, Calico, Spots, Ticking, Shade </div><br/><br/> สก็อตติช โฟล์ด เป็นเเมวขนาดกลางถึงใหญ่ รูปร่างกะทัดรัดเเละกลม ลำตัวเป็นกล้ามเนื้อแน่นแข็งเเรง โดยเพศเมียมีนำหนักราวๆ 2.5-4 กิโลกรัม ขณะที่เพศผู้มีน้ำหนักได้ถึง 5.8 กิโลกรัม มีจุดเด่นที่ใบหูพับลงไปข้างหน้า และพับลงต่ำ อีกทั้งขนาดของใบหูมีขนาดค่อนข้างเล็ก มีดวงตาที่กลมโตคล้ายนกฮูก หัวค่อนข้างกลม ช่วงคอสั้น และมีจมูกสันโค้งกว้างรับกับดวงตา บางสมาคมอาจขึ้นทะเบียนชนิดขนยาวว่า สก็อตติช โฟล์ด ลองแฮร์ ซึ่งขนที่ยาวนี้อาจจะมีผิวสัมผัสที่แตกต่างและต้องการการดูแลรักษาแมวพันธุ์สกอตติช โฟลด์ จัดว่าเป็นแมวที่มีขนาดกลาง มีคอสั้นเมื่อเทียบกับพันธุ์อื่น โดยแต่เดิมแล้วสกอตติช โฟลด์เป็นแมวที่มีขนสีขาวตามแมวที่ชื่อว่าซูซี่ ซึ่งเป็นบรรพบุรุษของพวกมัน แต่ในปัจจุบันสามารถพบได้หลายสี และมีทั้งสกอตติช โฟลด์ขนยาว และขนสั้น ซึ่งเกิดจากการพัฒนาสายพันธุ์ The Cat Fanciers Association (CFA) ได้แบ่งสกอตติช โฟลด์เป็นสองสายจากลักษณะของขน คือขนสั้น และขน</div>',
      dcs2: "สก๊อตติช โฟลด์มักมีนิสัยที่สุภาพ ฉลาด และมีนิสัยว่านอนสอนง่าย อีกทั้งยังสามารถปรับตัวได้ดี ยิ่งไปกว่านั้น สกอตติช โฟลด์เป็นแมวที่ชอบแสดงความรักมาก พวกมันติดเจ้าของมาก แต่ก็จะไม่รบกวนหรือทำให้รำคาญ อย่างไรก็ตาม แมวพันธุ์นี้ก็เหมือนกับแมวพันธุ์อื่น ๆ ตรงที่มักเพลิดเพลินกับการเล่น และสามารถตอบสนองต่อการฝึกได้ดีการเข้ากับเด็กสก๊อตติชเข้ากับเด็ก ๆ ได้ดี เหมาะกับครอบครัว อีกทั้งยังเหมาะกับครอบครัวที่มีสัตว์เลี้ยงอยู่แล้ว พวกมันเหมาะจะเป็นสมาชิกใหม่ของครอบครัว เพราะความปรับตัวได้ดี พวกมันมักชอบเรียกร้องความสนใจจากเด็ก ๆ อย่างมาก จะพยายามเข้าไปเล่น หรือคลอเคลียตลอดเวลา และจะไม่แสดงพฤติกรรมก้าวร้าวทำร้ายเด็ก ๆ",
      dcs3: "โรคที่พบบ่อยในเเมวสก๊อตติซโฟล์ด - โรคข้อเสื่อม โดยเฉพาะที่ข้อเท้า และข้อเข่า ซึ่งทำให้แมวเกิดความเจ็บปวด หรือมีอาการเคลื่อนไหวไม่สะดวก - โรคหัวใจโต กล้ามเนื้อหัวใจอ่อนแรง เป็นอีกโรคที่พบได้บ่อยในแมวสายพันธุ์สก๊อตทิช โฟลด์ ซึ่งยังไม่มีการยืนยันว่าพันธุกรรมมีส่วนให้เกิดโรคในแมวสายพันธุ์นี้หรือไม่ - โรคกล้ามเนื้อหัวใจเสื่อม (Dilated Cardiomyopathy : DCM) - โรควิตกกังวลต่อการแยกจาก หรือเกิดจากบาดแผลทางใจ (Separation Anxiety Disorder) - โรคทางพันธุกรรมเดี่ยวกับการเจริญผิดปกติของกระดูก (Osteochondrodysplasic) - ภาวะหลอดเลือดดำที่ตับลัดเข้าสู่ระบบหมุนเวียนเลือด (Portosystemic Shunts : PSS) - โรคทางเดินปัสสาวะส่วนล่างของแมว (Feline Lower Urinary Tract Disease : FLUTD) - ปัญหาช่องหู อันเนื่องมาจากใบหูที่พับ อาจทำให้เกิดปัญหาอับชื้นและเกิดปัญหาหูอักเสบตามมาได้ ป้องกันก่อนเกิดปัญหาได้ง่าย",
      id: 3,
      bgColor: "#EED7A1",
    },
  ];

  const [catDetail, setCatDetail] = useState(dataCat[0]);
  useEffect(() => {
    setCatDetail(
      dataCat.filter(
        (data) => data.id == window.location.pathname.split("/")[2]
      )[0]
    );
  }, []);

  return (
    <>
      <DetailCatBreed data={catDetail} />
      <CatModel data={catDetail} />
      <SlideCat data={dataCat} />
    </>
  );
}

export default CatBreedDetail;
